huaweiwx/ARDUINO_EFM32/hardware/arm/EFM32/cores/arduino/efm32_hal/emlib.h
#include "em_acmp.h"
#include "em_adc.h"
#include "em_aes.h"
#include "em_assert.h"
#include "em_burtc.h"
#include "em_bus.h"
#include "em_chip.h"
#include "em_cmu.h"
#include "em_common.h"
#include "em_core.h"
#include "em_cryotimer.h"
#include "em_crypto.h"
#include "em_csen.h"
#include "em_dac.h"
#include "em_dbg.h"
#include "em_dma.h"
#include "em_ebi.h"
#include "em_emu.h"
#include "em_gpcrc.h"
#include "em_gpio.h"
#include "em_i2c.h"
#include "em_idac.h"
// #include "em_int.h"
#include "em_lcd.h"
#include "em_ldma.h"
#include "em_lesense.h"
#include "em_letimer.h"
#include "em_leuart.h"
#include "em_mpu.h"
#include "em_msc.h"
#include "em_opamp.h"
#include "em_part.h"
#include "em_pcnt.h"
#include "em_prs.h"
#include "em_ramfunc.h"
#include "em_rmu.h"
#include "em_rtc.h"
#include "em_rtcc.h"
#include "em_smu.h"
#include "em_system.h"
#include "em_timer.h"
#include "em_usart.h"
#include "em_vcmp.h"
#include "em_vdac.h"
#include "em_version.h"
#include "em_wdog.h"
